fall2024/hnrs3385-fall2024.org
#+TITLE: HNRS 3385 - Honors Seminar
#+AUTHOR: 
#+DATE: Fall 2024
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt]
#+LATEX_HEADER: \usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \setlength{\parskip}{2mm}

** Contact info
- Professor: Thomas J. Faulkenberry, Ph.D
- Office: Admin Annex II, Room 105L
- Office hours: /tba/
- Email: faulkenberry@tarleton.edu
- Website: [[http://tomfaulkenberry.github.io]]
- Phone: 254-968-9816
  
** Course description

The ultimate goal of this course is to produce a thesis proposal. We will achieve several intermediary steps along the way to this goal, including completing required trainings and forms, selecting a topic/committee chair/committee member, creating timelines and outlines, and producing drafts. It is important to note that each thesis looks different, and while fundamental similarities can be identified, each thesis process is also a personal one. My goal is for us to work collectively to identify the similarities and fundamental principles that are shared by research of all areas, while also working with each of you individually to craft /your/ project.

Students enrolling in this course are required to accepted into the Presidential Honors Program, or have permission granted from the Dean of the Honors College.

** Course materials

There is no required textbook for the course. I will provide readings and other resources as needed on Canvas.
  
** Student learning outcomes
   
Students who complete this course successfully will be able to:

1. Formulate research questions within their field of study.
2. Critically analyze publications within their field of study.
3. Design a thesis-level research project within their field.
4. Write a thesis proposal.
5. Defend a thesis proposal.


** Requirements and grading

Grades will be assigned based on the percentage of points you accumulate from the following activities:

- First proposal draft = 20 points
- Final proposal draft = 20 points
- Other assignments = 60 points
- /Total points possible = 100 points/

The category "Other assignments" will include various assignments such as online research training, documentation, timelines, topic summaries, outlines, etc.  These will be explained more as we move through the semester. I will use the standard grading scale of A=90%, B=80%, etc.

*** Grading Feedback Expectations

For assignments submitted on time, you can expect to receive grades and feedback within one week of the due date.

*** Graded Class Participation

Class participation is not graded. However, the structure of the course is such that failure to participate is likely to result in poor performance.

*** Graded Attendance 

All absences should be discussed with me, ideally prior to class. Failure to attend at least 80% of class meetings may result in a dropped letter grade (e.g., an “A” would become a “B”). More importantly, the nature of this course is such that absences will almost certainly be reflected in the quality of your proposal.

*** Late/Make-up Work Policy

Late work will not be accepted in this course, barring certain emergencies. If you experience an emergency that interferes with your ability to submit an assignment on time, please contact me as soon as possible.

*** Use of Artificial Intelligence (AI)

This course is designed to foster the requisite skills needed to comprehend, evaluate, and write about your unique thesis topic. The naïve use of AI tools like ChatGPT can interfere with the development of these skills and is therefore highly discouraged. They can be a good tool for early topic exploration, but any product that you develop in this course should be almost entirely written by you. With all AI tools, "trust but verify" (and edit heavily!).

