fall2024/hnrs3385-fall2024.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-28 Wed 08:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HNRS 3385 - Honors Seminar</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">HNRS 3385 - Honors Seminar</h1>

<div id="outline-container-org244b8b7" class="outline-2">
<h2 id="org244b8b7">Contact info</h2>
<div class="outline-text-2" id="text-org244b8b7">
<ul class="org-ul">
<li>Professor: Thomas J. Faulkenberry, Ph.D</li>
<li>Office: Admin Annex II, Room 105L</li>
<li>Office hours: <i>tba</i></li>
<li>Email: faulkenberry@tarleton.edu</li>
<li>Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a></li>
<li>Phone: 254-968-9816</li>
</ul>
</div>
</div>

<div id="outline-container-org85f5e3b" class="outline-2">
<h2 id="org85f5e3b">Course description</h2>
<div class="outline-text-2" id="text-org85f5e3b">
<p>
The ultimate goal of this course is to produce a thesis proposal. We will achieve several intermediary steps along the way to this goal, including completing required trainings and forms, selecting a topic/committee chair/committee member, creating timelines and outlines, and producing drafts. It is important to note that each thesis looks different, and while fundamental similarities can be identified, each thesis process is also a personal one. My goal is for us to work collectively to identify the similarities and fundamental principles that are shared by research of all areas, while also working with each of you individually to craft <i>your</i> project.
</p>

<p>
Students enrolling in this course are required to accepted into the Presidential Honors Program, or have permission granted from the Dean of the Honors College.
</p>
</div>
</div>

<div id="outline-container-org43d806f" class="outline-2">
<h2 id="org43d806f">Course materials</h2>
<div class="outline-text-2" id="text-org43d806f">
<p>
There is no required textbook for the course. I will provide readings and other resources as needed on Canvas.
</p>
</div>
</div>

<div id="outline-container-org171d460" class="outline-2">
<h2 id="org171d460">Student learning outcomes</h2>
<div class="outline-text-2" id="text-org171d460">
<p>
Students who complete this course successfully will be able to:
</p>

<ol class="org-ol">
<li>Formulate research questions within their field of study.</li>
<li>Critically analyze publications within their field of study.</li>
<li>Design a thesis-level research project within their field.</li>
<li>Write a thesis proposal.</li>
<li>Defend a thesis proposal.</li>
</ol>
</div>
</div>


<div id="outline-container-org44b25a0" class="outline-2">
<h2 id="org44b25a0">Requirements and grading</h2>
<div class="outline-text-2" id="text-org44b25a0">
<p>
Grades will be assigned based on the percentage of points you accumulate from the following activities:
</p>

<ul class="org-ul">
<li>First proposal draft = 20 points</li>
<li>Final proposal draft = 20 points</li>
<li>Other assignments = 60 points</li>
<li><i>Total points possible = 100 points</i></li>
</ul>

<p>
The category "Other assignments" will include various assignments such as online research training, documentation, timelines, topic summaries, outlines, etc.  These will be explained more as we move through the semester. I will use the standard grading scale of A=90%, B=80%, etc.
</p>
</div>

<div id="outline-container-org98fa15d" class="outline-3">
<h3 id="org98fa15d">Grading Feedback Expectations</h3>
<div class="outline-text-3" id="text-org98fa15d">
<p>
For assignments submitted on time, you can expect to receive grades and feedback within one week of the due date.
</p>
</div>
</div>

<div id="outline-container-orga372c8d" class="outline-3">
<h3 id="orga372c8d">Graded Class Participation</h3>
<div class="outline-text-3" id="text-orga372c8d">
<p>
Class participation is not graded. However, the structure of the course is such that failure to participate is likely to result in poor performance.
</p>
</div>
</div>

<div id="outline-container-org9e5251a" class="outline-3">
<h3 id="org9e5251a">Graded Attendance</h3>
<div class="outline-text-3" id="text-org9e5251a">
<p>
All absences should be discussed with me, ideally prior to class. Failure to attend at least 80% of class meetings may result in a dropped letter grade (e.g., an “A” would become a “B”). More importantly, the nature of this course is such that absences will almost certainly be reflected in the quality of your proposal.
</p>
</div>
</div>

<div id="outline-container-org34dbe8d" class="outline-3">
<h3 id="org34dbe8d">Late/Make-up Work Policy</h3>
<div class="outline-text-3" id="text-org34dbe8d">
<p>
Late work will not be accepted in this course, barring certain emergencies. If you experience an emergency that interferes with your ability to submit an assignment on time, please contact me as soon as possible.
</p>
</div>
</div>

<div id="outline-container-org2d8b5c1" class="outline-3">
<h3 id="org2d8b5c1">Use of Artificial Intelligence (AI)</h3>
<div class="outline-text-3" id="text-org2d8b5c1">
<p>
This course is designed to foster the requisite skills needed to comprehend, evaluate, and write about your unique thesis topic. The naïve use of AI tools like ChatGPT can interfere with the development of these skills and is therefore highly discouraged. They can be a good tool for early topic exploration, but any product that you develop in this course should be almost entirely written by you. With all AI tools, "trust but verify" (and edit heavily!).
</p>
</div>
</div>
</div>
