fall2024/hnrs3385-fall2024.tex
% Created 2024-08-28 Wed 08:41
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\setlength{\parindent}{0pt}
\setlength{\parskip}{2mm}
\date{Fall 2024}
\title{HNRS 3385 - Honors Seminar}
\hypersetup{
 pdfauthor={},
 pdftitle={HNRS 3385 - Honors Seminar},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec:orgda3de57}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Admin Annex II, Room 105L
\item Office hours: \emph{tba}
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec:org6883ba3}

The ultimate goal of this course is to produce a thesis proposal. We will achieve several intermediary steps along the way to this goal, including completing required trainings and forms, selecting a topic/committee chair/committee member, creating timelines and outlines, and producing drafts. It is important to note that each thesis looks different, and while fundamental similarities can be identified, each thesis process is also a personal one. My goal is for us to work collectively to identify the similarities and fundamental principles that are shared by research of all areas, while also working with each of you individually to craft \emph{your} project.

Students enrolling in this course are required to accepted into the Presidential Honors Program, or have permission granted from the Dean of the Honors College.

\section*{Course materials}
\label{sec:org37bf40f}

There is no required textbook for the course. I will provide readings and other resources as needed on Canvas.

\section*{Student learning outcomes}
\label{sec:orgd9dbfc4}

Students who complete this course successfully will be able to:

\begin{enumerate}
\item Formulate research questions within their field of study.
\item Critically analyze publications within their field of study.
\item Design a thesis-level research project within their field.
\item Write a thesis proposal.
\item Defend a thesis proposal.
\end{enumerate}


\section*{Requirements and grading}
\label{sec:org70cdfa0}

Grades will be assigned based on the percentage of points you accumulate from the following activities:

\begin{itemize}
\item First proposal draft = 20 points
\item Final proposal draft = 20 points
\item Other assignments = 60 points
\item \emph{Total points possible = 100 points}
\end{itemize}

The category "Other assignments" will include various assignments such as online research training, documentation, timelines, topic summaries, outlines, etc.  These will be explained more as we move through the semester. I will use the standard grading scale of A=90\%, B=80\%, etc.

\subsection*{Grading Feedback Expectations}
\label{sec:org8c51d8c}

For assignments submitted on time, you can expect to receive grades and feedback within one week of the due date.

\subsection*{Graded Class Participation}
\label{sec:org40fca47}

Class participation is not graded. However, the structure of the course is such that failure to participate is likely to result in poor performance.

\subsection*{Graded Attendance}
\label{sec:orgdc5478f}

All absences should be discussed with me, ideally prior to class. Failure to attend at least 80\% of class meetings may result in a dropped letter grade (e.g., an “A” would become a “B”). More importantly, the nature of this course is such that absences will almost certainly be reflected in the quality of your proposal.

\subsection*{Late/Make-up Work Policy}
\label{sec:org04194d4}

Late work will not be accepted in this course, barring certain emergencies. If you experience an emergency that interferes with your ability to submit an assignment on time, please contact me as soon as possible.

\subsection*{Use of Artificial Intelligence (AI)}
\label{sec:orgd18f363}

This course is designed to foster the requisite skills needed to comprehend, evaluate, and write about your unique thesis topic. The naïve use of AI tools like ChatGPT can interfere with the development of these skills and is therefore highly discouraged. They can be a good tool for early topic exploration, but any product that you develop in this course should be almost entirely written by you. With all AI tools, "trust but verify" (and edit heavily!).
