fall2024/hnrs3385-fall2024.html

<div id="outline-container-org40890c7" class="outline-2">
<h2 id="org40890c7">Course Communication</h2>
<div class="outline-text-2" id="text-org40890c7">
<p>
This course is designed to be an intensive, interactive course.  That means that I will be available for one-on-one consultation most any time.  Just stop by my office or give me a call.
</p>

<p>
All official course communication (questions, setting up a meeting, etc.) will be conducted by email.  Any time you need to contact me, feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
</p>
<ul class="org-ul">
<li>please include the course number (HNRS 3385) in the subject line.</li>
<li>please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!</li>
</ul>

<p>
Occasionally, I may send a class announcement via Canvas messaging. However, I ask that you send your questions by email instead of Canvas messaging.
</p>
</div>
</div>

<div id="outline-container-org0e95f1c" class="outline-2">
<h2 id="org0e95f1c">University Policy on "F" Grades</h2>
<div class="outline-text-2" id="text-org0e95f1c">
<p>
Beginning in Fall 2015, Tarleton will begin differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.
</p>
</div>
</div>

<div id="outline-container-orgc8fb357" class="outline-2">
<h2 id="orgc8fb357">Academic Integrity Statement and Policy</h2>
<div class="outline-text-2" id="text-orgc8fb357">
<p>
Cheating, plagiarism, or doing work for another person who will receive academic credit is impermissible. This includes the use of unauthorized books, notebooks, or other sources in order to secure or give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place. Consult the following links for further information on academic conduct. 
</p>
<ul class="org-ul">
<li>Student Judicial Affairs: <a href="https://www.tarleton.edu/judicial/academicconduct.html">https://www.tarleton.edu/judicial/academicconduct.html</a></li>
<li>Student Handbook: <a href="https://www.tarleton.edu/studentrules/code-of-student-conduct.html">https://www.tarleton.edu/studentrules/code-of-student-conduct.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org97dc75a" class="outline-2">
<h2 id="org97dc75a">Americans with Disabilities Act (ADA) - Student Success</h2>
<div class="outline-text-2" id="text-org97dc75a">
<p>
Tarleton State University is committed to complying with the Americans with Disabilities Act (www.ada.gov) and other applicable laws. If you are a student with a disability seeking accommodation for this course, please contact the Office of Student Accessibility Services at 254.968.9650, studentaccessibilityservices@tarleton.edu,  or visit <a href="https://www.tarleton.edu/sas/">https://www.tarleton.edu/sas/</a> 
</p>
</div>
</div>

<div id="outline-container-orgc429201" class="outline-2">
<h2 id="orgc429201">Academic Affairs Core Values in the Classroom</h2>
<div class="outline-text-2" id="text-orgc429201">
</div>
<div id="outline-container-orgd8f7ff7" class="outline-3">
<h3 id="orgd8f7ff7">Academic Integrity</h3>
<div class="outline-text-3" id="text-orgd8f7ff7">
<p>
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.
</p>
</div>
</div>

<div id="outline-container-orga958d67" class="outline-3">
<h3 id="orga958d67">Academic Civility</h3>
<div class="outline-text-3" id="text-orga958d67">
<p>
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.
</p>
</div>
</div>

<div id="outline-container-org742036b" class="outline-3">
<h3 id="org742036b">Academic Excellence</h3>
<div class="outline-text-3" id="text-org742036b">
<p>
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
</p>
<ul class="org-ul">
<li>honoring Tarleton’s core values, upholding high standards of habit and behavior.</li>
<li>maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.</li>
<li>putting forth their best individual effort.</li>
<li>continually improving as independent learners.</li>
<li>engaging in extracurricular opportunities that encourage personal and academic growth.</li>
<li>reflecting critically upon feedback and applying these lessons to meet future challenges.</li>
</ul>
</div>
</div>
