fall2024/hnrs3385-fall2024.org
*** Student Rules

Students are responsible for knowing and abiding by the policies and information contained in the Tarleton Student Rules - https://www.tarleton.edu/studentrules.  


 
*Note:  any changes to this syllabus will be communicated to you by the instructor!*
 
** Tentative schedule

| Week | Date         | Potential topics covered                       |
|------+--------------+------------------------------------------------|
|    1 | August 28    | What is an honors thesis?                      |
|    2 | September 4  | Elements and structure of a good honors thesis |
|    3 | September 11 | Choosing a thesis topic and committee          |
|    4 | September 18 | Trainings and required documentation           |
|    5 | September 25 | The thesis process and various approaches      |
|    6 | October 2    | Creating a timeline and managing expectations  |
|    7 | October 9    | Reading and writing like a scholar             |
|    8 | October 16   | Tools for reading and writing                  |
|    9 | October 23   | No class -- continue reading and writing       |
|   10 | October 30   | In class writing group / progress check in     |
|   11 | November 6   | Tips and tricks for editing                    |
|   12 | November 13  | The defense -- what and why?                   |
|   13 | November 20  | No class -- continue writing                   |
|   14 | November 27  | No class -- Thanksgiving holiday               |
|   15 | December 4   | Tips for a successful defense                  |
|   16 | December 11  | Final proposal draft due!                      |
