fall2024/hnrs3385-fall2024.html

<div id="outline-container-org2b38c87" class="outline-3">
<h3 id="org2b38c87">Student Rules</h3>
<div class="outline-text-3" id="text-org2b38c87">
<p>
Students are responsible for knowing and abiding by the policies and information contained in the Tarleton Student Rules - <a href="https://www.tarleton.edu/studentrules">https://www.tarleton.edu/studentrules</a>.  
</p>



<p>
<b>Note:  any changes to this syllabus will be communicated to you by the instructor!</b>
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc8399c" class="outline-2">
<h2 id="orgbc8399c">Tentative schedule</h2>
<div class="outline-text-2" id="text-orgbc8399c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Potential topics covered</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">August 28</td>
<td class="org-left">What is an honors thesis?</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">September 4</td>
<td class="org-left">Elements and structure of a good honors thesis</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">September 11</td>
<td class="org-left">Choosing a thesis topic and committee</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">September 18</td>
<td class="org-left">Trainings and required documentation</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">September 25</td>
<td class="org-left">The thesis process and various approaches</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">October 2</td>
<td class="org-left">Creating a timeline and managing expectations</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">October 9</td>
<td class="org-left">Reading and writing like a scholar</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">October 16</td>
<td class="org-left">Tools for reading and writing</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">October 23</td>
<td class="org-left">No class &#x2013; continue reading and writing</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">October 30</td>
<td class="org-left">In class writing group / progress check in</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">November 6</td>
<td class="org-left">Tips and tricks for editing</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">November 13</td>
<td class="org-left">The defense &#x2013; what and why?</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">November 20</td>
<td class="org-left">No class &#x2013; continue writing</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">November 27</td>
<td class="org-left">No class &#x2013; Thanksgiving holiday</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">December 4</td>
<td class="org-left">Tips for a successful defense</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">December 11</td>
<td class="org-left">Final proposal draft due!</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Fall 2024</p>
<p class="date">Created: 2024-08-28 Wed 08:41</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
