fall2024/hnrs3385-fall2024.tex

\subsection*{Student Rules}
\label{sec:org8890477}

Students are responsible for knowing and abiding by the policies and information contained in the Tarleton Student Rules - \url{https://www.tarleton.edu/studentrules}.  



\textbf{Note:  any changes to this syllabus will be communicated to you by the instructor!}

\section*{Tentative schedule}
\label{sec:org4d3fceb}

\begin{center}
\begin{tabular}{rll}
Week & Date & Potential topics covered\\[0pt]
\hline
1 & August 28 & What is an honors thesis?\\[0pt]
2 & September 4 & Elements and structure of a good honors thesis\\[0pt]
3 & September 11 & Choosing a thesis topic and committee\\[0pt]
4 & September 18 & Trainings and required documentation\\[0pt]
5 & September 25 & The thesis process and various approaches\\[0pt]
6 & October 2 & Creating a timeline and managing expectations\\[0pt]
7 & October 9 & Reading and writing like a scholar\\[0pt]
8 & October 16 & Tools for reading and writing\\[0pt]
9 & October 23 & No class -- continue reading and writing\\[0pt]
10 & October 30 & In class writing group / progress check in\\[0pt]
11 & November 6 & Tips and tricks for editing\\[0pt]
12 & November 13 & The defense -- what and why?\\[0pt]
13 & November 20 & No class -- continue writing\\[0pt]
14 & November 27 & No class -- Thanksgiving holiday\\[0pt]
15 & December 4 & Tips for a successful defense\\[0pt]
16 & December 11 & Final proposal draft due!\\[0pt]
\end{tabular}
\end{center}
\end{document}
